podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SYSCON_LPC11xx.svd.xml
            <register>
               <name>SYSPLLCLKSEL</name>
               <description>System PLL clock source select</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>System PLL clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_OSCILLATOR</name>
                           <description>System oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSPLLCLKUEN</name>
               <description>System PLL clock source update enable</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable system PLL clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKSEL</name>
               <description>Main clock source select</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Clock source for main clock</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_CLOCK_TO_SYSTE</name>
                           <description>Input clock to system PLL</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_OSCILLATOR</name>
                           <description>WDT oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_PLL_CLOCK_OUT</name>
                           <description>System PLL clock out</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAINCLKUEN</name>
               <description>Main clock source update enable</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable main clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKDIV</name>
               <description>System AHB clock divider</description>
               <addressOffset>0x78</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>System AHB clock divider values 0: System clock disabled.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSAHBCLKCTRL</name>
               <description>System AHB clock control</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0x85F</resetValue>
               <fields>
                  <field>
                     <name>SYS</name>
                     <description>Enables clock for AHB to APB bridge, to the AHB matrix, to the Cortex-M0 FCLK and HCLK, to the SysCon, and to the PMU. This bit is read only</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROM</name>
                     <description>Enables clock for ROM</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ROM" > <name>RAM</name> <description>Enables clock for RAM</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>FLASHREG</name>
                     <description>Enables clock for flash register interface</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FLASHREG" > <name>FLASHARRAY</name> <description>Enables clock for flash array access</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>I2C</name> <description>Enables clock for I2C</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>GPIO</name> <description>Enables clock for GPIO</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT16B0</name> <description>Enables clock for 16-bit counter/timer 0</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT16B1</name> <description>Enables clock for 16-bit counter/timer 1</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT32B0</name> <description>Enables clock for 32-bit counter/timer 0</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CT32B1</name> <description>Enables clock for 32-bit counter/timer 1</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SSP0</name> <description>Enables clock for SPI0</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>UART</name> <description>Enables clock for UART. See Section 3.1 for part specific details</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>ADC</name> <description>Enables clock for ADC</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>WDT</name> <description>Enables clock for WDT</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>IOCON</name> <description>Enables clock for I/O configuration block</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>CAN</name> <description>Enables clock for C_CAN. See Section 3.1 for part specific details</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ROM" > <name>SSP1</name> <description>Enables clock for SPI1</description> <bitOffset>18</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SSP0CLKDIV</name>
               <description>SPI0 clock divider</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SPI0_PCLK clock divider values 0: Disable SPI0_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UARTCLKDIV</name>
               <description>UART clock divder</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>UART_PCLK clock divider values 0: Disable UART_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSP1CLKDIV</name>
               <description>SPI1 clock divder</description>
               <addressOffset>0x9C</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>SPI1_PCLK clock divider values 0: Disable SPI1_PCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLKSEL</name>
               <description>WDT clock source select</description>
               <addressOffset>0xD0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>WDT clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESERVED</name>
                           <description>Reserved</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLKUEN</name>
               <description>WDT clock source update enable</description>
               <addressOffset>0xD4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable WDT clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLKDIV</name>
               <description>WDT clock divider</description>
               <addressOffset>0xD8</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>WDT clock divider values 0: Disable WDCLK.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTCLKSEL</name>
               <description>CLKOUT clock source select</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>CLKOUT clock source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRC_OSCILLATOR</name>
                           <description>IRC oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSTEM_OSCILLATOR</name>
                           <description>System oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WATCHDOG_OSCILLATOR</name>
                           <description>Watchdog oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLOCK</name>
                           <description>Main clock</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTUEN</name>
               <description>CLKOUT clock source update enable</description>
               <addressOffset>0xE4</addressOffset>
               <fields>
                  <field>
                     <name>ENA</name>
                     <description>Enable CLKOUT clock source update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE</name>
                           <description>No change</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_CLOCK_SOURCE</name>
                           <description>Update clock source</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKOUTCLKDIV</name>
               <description>CLKOUT clock divider</description>
               <addressOffset>0xE8</addressOffset>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Clock output divider values 0: Disable CLKOUT.  1: Divide by 1. to 255: Divide by 255</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP0</name>
               <description>POR captured PIO status 0</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CAPPIO0_n</name>
                     <description>Raw reset status input PIO0_n: PIO0_11 to PIO0_0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO1_n</name>
                     <description>Raw reset status input PIO1_n: PIO1_11 to PIO1_0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_n</name>
                     <description>Raw reset status input PIO2_n: PIO2_7 to PIO2_0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIOPORCAP1</name>
               <description>POR captured PIO status 1</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CAPPIO2_8</name>
                     <description>Raw reset status input PIO2_8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_9</name>
                     <description>Raw reset status input PIO2_9</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_10</name>
                     <description>Raw reset status input PIO2_10</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO2_11</name>
                     <description>Raw reset status input PIO2_11</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_0</name>
                     <description>Raw reset status input PIO3_0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_1</name>
                     <description>Raw reset status input PIO3_1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_2</name>
                     <description>Raw reset status input PIO3_2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_3</name>
                     <description>Raw reset status input PIO3_3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_4</name>
                     <description>Raw reset status input PIO3_4</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAPPIO3_5</name>
                     <description>Raw reset status input PIO3_5</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
